import pandas
KB = {
    ("дизельний двигун", "перевага", "економічність на далеких відстанях"),
    ("дизельний двигун", "недолік", "вищі викиди"),
    ("бензиновий двигун", "перевага", "менший рівень шуму"),
    ("бензиновий двигун", "недолік", "вища витрата пального"),
    ("електричний двигун", "перевага", "екологічність"),
    ("електричний двигун", "недолік", "обмежений запас ходу"),
    ("електричний двигун", "перевага", "низькі експлуатаційні витрати"),
}
df = pandas.DataFrame(columns=["s","p","o"])
i=0
for s,p,o in KB:
    df.loc[i]={"s":s, "p":p, "o":o}
    i+=1
#df.to_csv('kb.csv', index=False)
df = pandas.read_csv('kb.csv')